GetJTGT2231012020
Syntax
SapObject.SapModel.Func.FuncRS.GetJTGT2231012020
VB6 Procedure
Function GetJTGT2231012020(ByVal Name As String, ByRef PeakAccel As Double, ByRef Tg As Double, ByRef Ci As Double, ByRef Cs As Double, ByRef DampRatio As Double) As Long
Parameters
Name
The name of a JTGT2231012020 response spectrum function.
PeakAccel
The peak ground acceleration.
Tg
The characteristic ground period, Tg > 0.1 [s]
Ci
The importance coefficient.
Cs
The site soil coefficient.
DampRatio
The damping ratio for the function, 0 <= DampRatio < 1.
Remarks
This function retrieves the definition of a JTGT2231012020 response spectrum function.
The function returns zero if the function definition is successfully retrieved; otherwise it returns a nonzero value.
VBA Example
Sub GetRSFuncJTGT2231012020()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim PeakAccel As Double
 Dim Tg As Double
 Dim Ci As Double
 Dim Cs As Double
 Dim DampRatio As Double
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'add JTGT2231012020 RS function
 ret = SapModel.Func.FuncRS.SetJTGT2231012020("RS-1", 0.18, 0.36, 0.4, 1, 0.04)
 'get JTG/T 2231-01-2020 RS function
 ret = SapModel.Func.FuncRS.GetJTGT2231012020("RS-1", PeakAccel, Tg, Ci, Cs, DampRatio)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in v23.2.0
See Also
SetJTGT2231012020